# -*- coding: utf-8 -*-
# 三角数の数列は自然数の和で表わされ, 7番目の三角数は 1 + 2 + 3 + 4 + 5 + 6 + 7 = 28 である. 三角数の最初の10項は:

# 1, 3, 6, 10, 15, 21, 28, 36, 45, 55, ...
# となる.

# 最初の7項について, その約数を列挙すると, 以下のとおり.

#  1: 1
#  3: 1,3
#  6: 1,2,3,6
# 10: 1,2,5,10
# 15: 1,3,5,15
# 21: 1,3,7,21
# 28: 1,2,4,7,14,28

# これから, 7番目の三角数である28は, 5個より多く約数をもつ最初の三角数であることが分かる.

# では, 500個より多く約数をもつ最初の三角数はいくつか.

require 'prime'

BOUND = 500

def triangle_num(n)
  n*(n+1)/2
end

def main
  n = 8 #8番目の三角数からスタート
  while true 
    tn = triangle_num(n)
    #素因数分解 (例: Prime.prime_division(28) => [[2, 2], [7, 1]] )
    p_div = Prime.prime_division(tn)
    #約数の個数の計算 (例: [[2, 2], [7, 1]] => (2+1)*(1+1) = 6 )
    num_div = p_div.map{|p| p[1]+1}.inject(:*)
    if num_div > BOUND
      puts tn
      break
    end
    n += 1
  end
end

main
