# -*- coding: utf-8 -*-
# 2の平方根は無限に続く連分数で表すことができる.

# √ 2 = 1 + 1/(2 + 1/(2 + 1/(2 + ... ))) = 1.414213...
# 最初の4回の繰り返しを展開すると以下が得られる.

# 1 + 1/2 = 3/2 = 1.5
# 1 + 1/(2 + 1/2) = 7/5 = 1.4
# 1 + 1/(2 + 1/(2 + 1/2)) = 17/12 = 1.41666...
# 1 + 1/(2 + 1/(2 + 1/(2 + 1/2))) = 41/29 = 1.41379...

# 次の3つの項は99/70, 239/169, 577/408である. 第8項は1393/985である. これは分子の桁数が分母の桁数を超える最初の例である.

# 最初の1000項を考えたとき, 分子の桁数が分母の桁数を超える項はいくつあるか?
BOUND = 1000

def main
  count = 0
  #n番目の項を表す分数をf(n) = b/aとする．
  #この時，f(n+1) = 1 + 1/(1+f(n)) = 1 + 1/(1+b/a) = (2a+b)/(a+b)．  
  a,b = 2,3 #1回目(f(1) = 3/2)
  (BOUND-1).times{ #残り999回
    an,bn = a+b,2*a+b
    if bn.to_s.size > an.to_s.size
      count += 1
    end
    a,b = an,bn
  }
  puts count
end

main
